BankXml/RTGS_encrypted_and_signed.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns3:getStrukturaRtgsNalogaRequest xmlns:ns2="http://nalogZaPlacanje.com" xmlns:ns3="http://strukturaRtgsNaloga.com" xmlns:ns4="http://mt102.BankXml.bankXml.example.com"><ns3:strukturaRtgsNaloga datum_naloga="2017-06-19" datum_valute="2017-06-19" sifra_valute="RSD"><ns3:id_poruke><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>c7jgwm2UyAZSopF1einYBw1PI4XXrZUgCRjd3Df9a0eNxl+cTt0VB44yDTuQEGwPu/BO3kL8Vuo2&#13;
vG6smofHruNO3JLSj6E/X0WlxCHfhZvnGU5sJ9eIlYMqOPvZUPPG6Ypm6BwzDyR1Bki8IPy9lc9+&#13;
74NAHaIgXMXAN6lAYi0=</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>0HofS20iJA5NYkBIVYEzZw==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns3:id_poruke><ns3:swift_kod_banke_duznika/><ns3:obracunski_racun_banke_duznika/><ns3:swift_kod_banke_poverioca/><ns3:obracunski_racun_banke_poverioca/><ns3:duznik_nalogodavac>levi</ns3:duznik_nalogodavac><ns3:svrha_placanja>Svrha placanja</ns3:svrha_placanja><ns3:primalac_poverilac>ftn</ns3:primalac_poverilac><ns3:racun_duznika>200636547896321456</ns3:racun_duznika><ns3:model_zaduzenja>92</ns3:model_zaduzenja><ns3:poziv_na_broj_zaduzenja>41247412</ns3:poziv_na_broj_zaduzenja><ns3:racun_poverioca>400254547845612156</ns3:racun_poverioca><ns3:model_odobrenja>97</ns3:model_odobrenja><ns3:poziv_na_broj_odobrenja>147541214</ns3:poziv_na_broj_odobrenja><ns3:iznos>260000</ns3:iznos></ns3:strukturaRtgsNaloga></ns3:getStrukturaRtgsNalogaRequest></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>0Bb63PnNpj9WOZ05JgAIXr2DfoE=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
JIjplOskRN6c9FtVMIx2lB1yK+39+5utz47s0Pnydcyvpi85A6RskqICwJp8FoJGPLrvA+hEii0T&#13;
zJAQBxa3mjXLfmXmnCmbU8Cho3lwrSLXuEKTJ1AQtvKaUzJ7oodX4BH7KhZmU+m73zKQvq7ykUjZ&#13;
Z9+FfuRsfkEPbk+iKTQ=
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
zQ9KJLShafi/S2HkWlfnRpKcuLB4BgeJ5y2wBafGRRNz5kss0gjzzQZIDf684gwQ2WYEDlH2s+OX&#13;
fbX4v6KTKJ4ug0wfY05sciJ7Dx+HOPUw6KU5aWvbBIKAXJE+MCSaO/FSk+ujgXSZAY/epUsSqBo2&#13;
EZgUl90oEpTRbV+xX8E=
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIBtjCCAR8CBEZasCQwDQYJKoZIhvcNAQEFBQAwIjEPMA0GA1UECwwGcHJpbWVyMQ8wDQYDVQQD&#13;
DAZwcmltZXIwHhcNMDcwNTI4MTAzNDEyWhcNMjcwNTIzMTAzNDEyWjAiMQ8wDQYDVQQLDAZwcmlt&#13;
ZXIxDzANBgNVBAMMBnByaW1lcjCBnzANBgkqhkiG9w0BAQEFAAOBjQAwgYkCgYEAzQ9KJLShafi/&#13;
S2HkWlfnRpKcuLB4BgeJ5y2wBafGRRNz5kss0gjzzQZIDf684gwQ2WYEDlH2s+OXfbX4v6KTKJ4u&#13;
g0wfY05sciJ7Dx+HOPUw6KU5aWvbBIKAXJE+MCSaO/FSk+ujgXSZAY/epUsSqBo2EZgUl90oEpTR&#13;
bV+xX8ECAwEAATANBgkqhkiG9w0BAQUFAAOBgQB2HjPI427zRaVfLTaeNVcjH9hoTkl9OUJAAmEa&#13;
6EQdbdqZ75ca3IfuLHJFJ8zzyBP4LUGSxgA4OpnKs6Ej5w2n0GHmu0g4YqxInfpv/kCwswoia4Oz&#13;
a17te8mMamffCn3ySX5yZzEex5nueNAyhJkmWBcBCOvJw4+U+gSK50Xbcw==
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>